<a href="https://colab.research.google.com/github/barkle2/Programming/blob/master/%5BPython%5D%20Pandas/Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Pandas/friends.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## DataFrame 행, 열 선택 및 필터

In [3]:
# 1, 2번 행만 선택하기
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [4]:
# 특정 행만 선택하기
select_list = [0,2]
df.loc[select_list]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [5]:
# 조건으로 선택하기
df[df.age > 25]
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [6]:
# 다중 조건
df[ (df.age>25) & (df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

In [7]:
# index로 컬럼 필터링
df.iloc[1:5, 0:2]

    name  age
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45

In [8]:
# name으로 컬럼 필터링
df[['name', 'age']]
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [9]:
# 이름에 a가 들어간 컬럼만 선택
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [10]:
# 정규표현식으로 이름이 b로 끝나는 컬럼 선택하기
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern